In [15]:
import numpy as np
import pandas as pd

In [16]:
from pandas import *
from numpy import *


# DataFrame (Pandas)

## 一、生成一个DataFrame
### 1. 存整数的DataFrame

In [17]:
df = DataFrame(np.arange(16).reshape(4,4), index= list("ABCD"), columns=list('wxyz'))
df

    w   x   y   z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

In [18]:
df = DataFrame(np.random.randint(low=0, high=10, size=(3,5)))
df

   0  1  2  3  4
0  2  8  2  6  4
1  0  1  9  6  3
2  5  6  1  7  1

### 2. 浮点数的DataFrame

In [20]:
df = DataFrame(np.random.random(size=(3,5)))
df

          0         1         2         3         4
0  0.899712  0.579274  0.501907  0.336697  0.488179
1  0.289358  0.819762  0.486741  0.957266  0.043107
2  0.084751  0.244503  0.968620  0.833228  0.793185

## 二、查看数据

### 1. 查看行数据

In [22]:
data = np.arange(9).reshape(3,3);
frame = DataFrame(data);
frame

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [29]:
#  查看 所有数据
frame.head()
# or
frame.tail()

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [30]:
#  查看前 2 行
frame.head(2)

   0  1  2
0  0  1  2
1  3  4  5

In [31]:
#  查看后 2 行
frame.tail(2)

   0  1  2
1  3  4  5
2  6  7  8

### 2. 转置

In [32]:
# 转置 （行 -> 列）
frame.T

   0  1  2
0  0  3  6
1  1  4  7
2  2  5  8

### 3. index、columns、values 查看

In [43]:
frame = DataFrame(data, index=list('abc'), columns=list('ABC'))
# frame = DataFrame(data);
frame

   A  B  C
a  0  1  2
b  3  4  5
c  6  7  8

In [44]:
frame.index

Index(['a', 'b', 'c'], dtype='object')

In [45]:
frame.columns

Index(['A', 'B', 'C'], dtype='object')

In [46]:
frame.values

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

### 4. 轴排序

In [69]:
frame = DataFrame(np.random.randint(low=0, high=10, size=(3,5)), columns=list('ABCDE'))
frame

   A  B  C  D  E
0  6  0  2  4  9
1  9  5  2  0  2
2  5  9  1  9  4

In [70]:
# （default）axis = 0 , 对 index 进行排序
# axis = 1 , 对columns 进行排序
res = frame.sort_index(axis=1, ascending=False);
res

   E  D  C  B  A
0  9  4  2  0  6
1  2  0  2  5  9
2  4  9  1  9  5

### 5. 值排序

In [78]:
frame = DataFrame(np.random.randint(low=0, high=10, size=(3,5)), columns=list('ABCDE'))
print(frame)
# inplace = True 时，源DataFrame 数据会改变
res = frame.sort_values(by=['C','D'], axis=0, ascending=True, inplace = False, na_position='last')
res

   A  B  C  D  E
0  6  5  5  8  9
1  0  8  9  3  0
2  2  8  0  6  9

   A  B  C  D  E
2  2  8  0  6  9
0  6  5  5  8  9
1  0  8  9  3  0

## 三、筛选

### 1. 一行、一列

In [79]:
frame = DataFrame({'name':['Jasper','Fang','Ming'], 'age': [18, 19, 20]})
frame

     name  age
0  Jasper   18
1    Fang   19
2    Ming   20

In [82]:
# 一行
# frame.loc[0]
frame.iloc[0]

name    Jasper
age         18
Name: 0, dtype: object

In [91]:
# 一列
frame.loc[:, ['name']]
# frame.iloc[:, [0]]

# Series
# res = frame.loc[:]['name']

     name
0  Jasper
1    Fang
2    Ming

### 2. 筛选特定的位置

In [92]:
frame = DataFrame({'name':['Jasper','Fang','Ming'], 'age': [18, 19, 20], 'salary': [1800.0, 1955.5, 2230.8]})
frame

     name  age  salary
0  Jasper   18  1800.0
1    Fang   19  1955.5
2    Ming   20  2230.8

In [95]:
# 前两行，前两列 （0,1）
frame.iloc[:2, :2]

     name  age
0  Jasper   18
1    Fang   19

In [96]:
# 第1、3 行的第2列
frame.loc[[0,2], ['age']]

   age
0   18
2   20

### 3. 列条件 筛选

In [100]:
frame = DataFrame({'name':['Jasper','Fang','Ming'], 'age': [18, 19, 20], 'salary': [1800.0, np.nan, 2230.8]})
frame

     name  age  salary
0  Jasper   18  1800.0
1    Fang   19     NaN
2    Ming   20  2230.8

In [101]:
frame[frame['age']<=18]

     name  age  salary
0  Jasper   18  1800.0

In [105]:
# salary 列 中， 为空的那一行
frame[np.isnan(frame['salary'])]

   name  age  salary
1  Fang   19     NaN

In [128]:
# salary 列中，不为空的记录

# 删除 整行都是NaN 的行
res = frame.dropna(axis=0, how='all')
# 删除一行中存在NaN 的行
res = frame.dropna(axis=0, how='any')
# 删除 一列中存在NaN的列
res = frame.dropna(axis=1, how='any')
res

     name  age
0  Jasper   18
1    Fang   19
2    Ming   20